Autodesk.Revit.DB.Point.Create(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Visibility,System.Int32)
Creates a point at the given coordinates and assigns it the specified GraphicsStyle and Visibility.
Since:  2021
coord:  The coordinates where the point will be created.
id:  The id of the GraphicsStyle element from which to apply the point properties.
visibility:  The visibility to apply to the point object.
size:  The size to apply to the point object.
Returns:  A Point object.
Exception is thrown unless visibility is set to Visible, Highlight or Invisible.

Autodesk.Revit.DB.Point.Size
Returns the size of the point.

Autodesk.Revit.DB.Point.Create(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ElementId)
Creates a point at the given coordinates and assigns it the specified GraphicsStyle.
Since:  2016
coord:  The coordinates where the point will be created.
id:  The id of the GraphicsStyle element from which to apply the point properties.
Returns:  A Point object.